Laravel
ドッカーのインストール、laravelの基礎知識
getメソッドの使い方
ファイルのインポート、ダウンロード、削除方法
フォーム入力画面と入力データのバリデーション
エラーメッセージ
メール送信機能
DB マイグレーション、ロールバック
ブログ一覧画面
投稿記事の追加、編集、削除、並び替え
ユーザー登録
ログイン機能
auth,guestメソッド
セキュリティ対策

Laravel学習おさらい開始
環境の構築
ビューファイル、レイアウトの作成、コントローラー
クエリーパラメーター、ルートパラメーター
ファイルのアップロード、削除、ダウンロード

猫カフェサイト
バリデーション
電話番号の正規表現でのチェック
フォームリクエスト
マイグレーション(DB定義をPHPコードにて管理する)、ロールバック
モデル、データの追加、編集
DBから取得するデータを指定するクエリービルダー
DB以外の配列要素に検索、集計が行えるようになるコレクション（配列のアップグレード版）
リレーション、外部キー設定
1対多、多対多のリレーション

自作挑戦
バリデーション用ファイル「リクエストフォーム」を作成
メール用パッケージ mailable クラスの作成
DB操作
バリデーション、クエリービルダ、リレーション（１対多、多対多)
認証機能
オリジナル要素
ユーザー登録機能を追加
顧客側ページの補強、猫情報の紐付け
お問合せ内容表示、削除機能


オリジナルアプリの開発
wordpressとの違い
・複数人が共有して情報法を送受信できるように
・お問合せ内容の送信と登録
・ユーザー情報の登録
・ログイン、ログアウトボタン出し入れ
・会員専用のホーム画面作成
・ブログ投稿、詳細画面、編集、削除
・ユーザー情報表示
・ナブ機能追加(よくある質問、おすすめスポット導入)
・オーナーのルート作成とナブ画面整理
おおよそ完成！

Laravelホームページを使った復習
プロジェクト内の各フォルダの目的
リクエスト時の流れ(public → リクエストに応じ、カーネルへ分配 → アプリをインスタンス化、必要なものだけ登録(サービスプロバイダ)、)

専門用語
デプロイ、インターフェース　
レート制限
オーバーライド
タイプヒント
Eloquentモデル
CSRF
コンパイル
バリデーション、クエリービルダ、リレーション（１対多、多対多)
